{
  "100": "ดำเนินการต่อ. เซิร์ฟเวอร์ได้รับส่วนหัวของคำขอแล้ว และไคลเอนต์ควรดำเนินการส่งเนื้อหาคำขอต่อไป",
  "101": "เปลี่ยนโปรโตคอล. ผู้ร้องขอให้เซิร์ฟเวอร์เปลี่ยนโปรโตคอล",
  "200": "สำเร็จ. คำขอได้รับการประมวลผลเรียบร้อยแล้ว",
  "201": "สร้างแล้ว. คำขอได้รับการตอบสนอง และสร้างทรัพยากรใหม่หนึ่งหรือมากกว่า",
  "202": "ยอมรับแล้ว. คำขอได้รับการยอมรับเพื่อการประมวลผล แต่ยังไม่เสร็จสิ้น",
  "203": "ข้อมูลไม่เชื่อถือได้. เซิร์ฟเวอร์ได้รับการตอบรับ 200 OK จากเซิร์ฟเวอร์ต้นทาง แต่ได้เปลี่ยนแปลงข้อมูลบางส่วน",
  "204": "ไม่มีเนื้อหา. เซิร์ฟเวอร์ประมวลผลคำขอสำเร็จ และไม่มีเนื้อหาที่จะแสดง",
  "205": "รีเซ็ตเนื้อหา. เซิร์ฟเวอร์ประมวลผลคำขอสำเร็จ และขอให้ผู้ร้องรีเซ็ตมุมมองเอกสาร",
  "206": "เนื้อหาบางส่วน. เซิร์ฟเวอร์กำลังส่งทรัพยากรบางส่วนตามคำขอของไคลเอนต์",
  "300": "มีหลายตัวเลือก. มีหลายตัวเลือกที่ไคลเอนต์สามารถเลือกใช้ได้",
  "301": "ย้ายถาวร. คำขอทั้งหมดในอนาคตควรถูกเปลี่ยนเส้นทางไปยัง URI ที่ให้มา",
  "302": "พบแล้ว. ทรัพยากรถูกย้ายชั่วคราวไปยัง URI อื่น",
  "303": "ดูที่อื่น. สามารถหาคำตอบของคำขอได้จาก URI อื่นด้วยวิธี GET",
  "304": "ไม่เปลี่ยนแปลง. ทรัพยากรไม่เปลี่ยนแปลงจากเวอร์ชันที่ระบุในส่วนหัวของคำขอ",
  "305": "ใช้พร็อกซี่. ทรัพยากรที่ร้องขอต้องเข้าถึงผ่านพร็อกซี่ที่ระบุในช่อง Location",
  "307": "ย้ายชั่วคราว. คำขอควรถูกทำซ้ำด้วย URI อื่น แต่คำขอในอนาคตยังคงใช้ URI เดิม",
  "308": "ย้ายถาวร. คำขอและคำขอในอนาคตควรถูกเปลี่ยนเส้นทางไปยัง URI อื่น",
  "400": "คำขอไม่ถูกต้อง. กรุณาตรวจสอบข้อมูลของคุณ",
  "401": "การเข้าถึงไม่ถูกต้อง. กรุณาเข้าสู่ระบบ",
  "402": "ต้องการการชำระเงิน. สำรองไว้สำหรับการใช้งานในอนาคต",
  "403": "ห้ามเข้าถึง. คุณไม่มีสิทธิ์เข้าถึงทรัพยากรนี้",
  "404": "ไม่พบทรัพยากร",
  "405": "ไม่อนุญาตให้ใช้วิธีนี้. วิธีการที่ระบุในคำขอไม่ถูกต้อง",
  "406": "ไม่สามารถยอมรับได้. ทรัพยากรที่ร้องขอไม่สามารถสร้างเนื้อหาตามที่กำหนดในคำขอ",
  "407": "ต้องการการรับรองพร็อกซี่. ไคลเอนต์ต้องยืนยันตัวตนกับพร็อกซี่ก่อน",
  "408": "หมดเวลาคำขอ. เซิร์ฟเวอร์รอคำขอนานเกินไป",
  "409": "ความขัดแย้ง. คำขอไม่สามารถประมวลผลได้เนื่องจากความขัดแย้งกับสถานะปัจจุบันของทรัพยากร",
  "410": "หายไป. ทรัพยากรไม่สามารถใช้งานได้และจะไม่กลับมาอีก",
  "411": "ต้องระบุความยาว. คำขอไม่ได้ระบุความยาวของเนื้อหา ซึ่งเป็นสิ่งจำเป็นสำหรับทรัพยากรที่ร้องขอ",
  "412": "เงื่อนไขล้มเหลว. เซิร์ฟเวอร์ไม่ตรงตามเงื่อนไขที่ร้องขอ",
  "413": "เนื้อหามากเกินไป. คำขอมีขนาดใหญ่เกินกว่าที่เซิร์ฟเวอร์จะประมวลผลได้",
  "414": "URI ยาวเกินไป. URI ที่ให้มานั้นยาวเกินกว่าที่เซิร์ฟเวอร์จะประมวลผลได้",
  "415": "ประเภทสื่อไม่รองรับ. เอนทิตีในคำขอมีประเภทสื่อที่เซิร์ฟเวอร์หรือทรัพยากรไม่รองรับ",
  "416": "ช่วงที่ร้องขอไม่พอ. ไคลเอนต์ขอส่วนของไฟล์ แต่เซิร์ฟเวอร์ไม่สามารถจัดหาส่วนนั้นได้",
  "417": "ความคาดหวังล้มเหลว. เซิร์ฟเวอร์ไม่สามารถตอบสนองความคาดหวังของส่วนหัวคำขอได้",
  "418": "ฉันคือกาน้ำชา. (ใช้เป็นเรื่องตลกวัน April Fools')",
  "422": "หน่วยงานที่ประมวลผลไม่ได้. คำขอถูกจัดรูปแบบถูกต้อง แต่ไม่สามารถดำเนินการเนื่องจากข้อผิดพลาดทางความหมาย",
  "423": "ล็อคแล้ว. ทรัพยากรที่กำลังเข้าถึงถูกล็อค",
  "424": "การพึ่งพาล้มเหลว. คำขอล้มเหลวเนื่องจากคำขอก่อนหน้านี้ล้มเหลว",
  "425": "เร็วเกินไป. เซิร์ฟเวอร์ไม่เต็มใจที่จะเสี่ยงในการประมวลผลคำขอที่อาจถูกทำซ้ำ",
  "426": "ต้องการการอัปเกรด. ไคลเอนต์ควรเปลี่ยนไปใช้โปรโตคอลอื่น",
  "428": "ต้องการเงื่อนไขล่วงหน้า. เซิร์ฟเวอร์ต้องการให้คำขอมีเงื่อนไขเพื่อป้องกันปัญหาการอัปเดตที่สูญหาย",
  "429": "คำขอมากเกินไป. กรุณาลองใหม่อีกครั้งในภายหลัง",
  "431": "ส่วนหัวของคำขอมีขนาดใหญ่เกินไป. เซิร์ฟเวอร์ไม่เต็มใจที่จะประมวลผลคำขอเนื่องจากส่วนหัวของคำขอมีขนาดใหญ่เกินไป",
  "451": "ไม่สามารถใช้งานได้เนื่องจากเหตุผลทางกฎหมาย. ทรัพยากรถูกปิดกั้นเนื่องจากข้อเรียกร้องทางกฎหมาย",
  "500": "ข้อผิดพลาดภายในเซิร์ฟเวอร์. กรุณาลองใหม่อีกครั้งในภายหลัง",
  "501": "ไม่ได้ดำเนินการ. เซิร์ฟเวอร์ไม่รู้จักวิธีการร้องขอหรือไม่มีความสามารถในการตอบสนองคำขอ",
  "502": "เกตเวย์ไม่ถูกต้อง. เซิร์ฟเวอร์ล้มเหลวหรือไม่สามารถเข้าถึงได้",
  "503": "บริการไม่พร้อมใช้งาน. กรุณาลองใหม่อีกครั้งในภายหลัง",
  "504": "หมดเวลาเกตเวย์. เซิร์ฟเวอร์ที่ทำหน้าที่เป็นเกตเวย์หรือพร็อกซี่ไม่ได้รับการตอบสนองตามเวลาที่กำหนดจากเซิร์ฟเวอร์ต้นทาง",
  "505": "ไม่รองรับเวอร์ชัน HTTP. เซิร์ฟเวอร์ไม่รองรับเวอร์ชันของโปรโตคอล HTTP ที่ใช้ในคำขอ",
  "507": "พื้นที่จัดเก็บไม่เพียงพอ. เซิร์ฟเวอร์ไม่สามารถจัดเก็บการตอบสนองที่จำเป็นเพื่อดำเนินการคำขอให้เสร็จสิ้น",
  "508": "ตรวจพบการวนลูป. เซิร์ฟเวอร์ตรวจพบลูปที่ไม่สิ้นสุดระหว่างการประมวลผลคำขอ",
  "510": "ไม่ได้ขยาย. จำเป็นต้องขยายคำขอเพิ่มเติมเพื่อให้เซิร์ฟเวอร์สามารถดำเนินการได้",
  "511": "ต้องการการรับรองเครือข่าย. ไคลเอนต์จำเป็นต้องยืนยันตัวตนเพื่อเข้าถึงเครือข่าย"
}
